Revit 2024 API
ParameterTypeId.CurveElemDefinesSlope Property
 "Defines Beam System Slope"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CurveElemDefinesSlope { get; }
Visual Basic
Public Shared ReadOnly Property CurveElemDefinesSlope As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurveElemDefinesSlope {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace